# ViewSolarstudyAnimationSpeedValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyAnimationSpeedValue Property
ParameterTypeId Class See Also
---
"Loop animation speed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyAnimationSpeedValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyAnimationSpeedValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyAnimationSpeedValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace